2025.03.18.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-18 Tue 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2025.03.11.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2025.03.25.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of March 11 to 18, 2025.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#1">Upgrading Semgrep from OCaml 4 to OCaml 5 + dynamic_gc utility</a></li>
<li><a href="#2">Open source OCaml algotrading with longleaf 1.0.0</a></li>
<li><a href="#3">Neocaml - a TreeSitter-powered Emacs package for OCaml programming</a></li>
<li><a href="#4">Senior Software Engineer at Bloomberg. New York</a></li>
<li><a href="#5">Upcoming Cmdliner 2.0 changes that need your attention</a></li>
<li><a href="#6">Dune dev meeting</a></li>
<li><a href="#7">New release of Monolith (20250314)</a></li>
<li><a href="#8">dream_middleware_ext v0.1.0</a></li>
<li><a href="#9">Learn Programming with OCaml (new book)</a></li>
<li><a href="#10">Other OCaml News</a></li>
<li><a href="#org7e451d8">Old CWN</a></li>
</ul>
</div>
</div>
<div id="outline-container-1" class="outline-2">
<h2 id="1">Upgrading Semgrep from OCaml 4 to OCaml 5 + dynamic_gc utility</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/upgrading-semgrep-from-ocaml-4-to-ocaml-5-dynamic-gc-utility/16256/1">https://discuss.ocaml.org/t/upgrading-semgrep-from-ocaml-4-to-ocaml-5-dynamic-gc-utility/16256/1</a>
</p>
</div>
<div id="outline-container-org1250a52" class="outline-3">
<h3 id="org1250a52">Nat Mote announced</h3>
<div class="outline-text-3" id="text-org1250a52">
<p>
I've written up my experience <a href="https://semgrep.dev/blog/2025/upgrading-semgrep-from-ocaml-4-to-ocaml-5/">upgrading Semgrep to OCaml 5</a>. The main barrier we faced was increased memory consumption, but I was able to tune the garbage collector to address this problem. We have also open-sourced the <a href="https://github.com/semgrep/dynamic-gc">utility I wrote</a> to adjust the <code>space_overhead</code> GC parameter based on heap size. We are looking forward to taking advantage of all the great new features in OCaml 5!
</p>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="2">Open source OCaml algotrading with longleaf 1.0.0</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/open-source-ocaml-algotrading-with-longleaf-1-0-0/16264/1">https://discuss.ocaml.org/t/open-source-ocaml-algotrading-with-longleaf-1-0-0/16264/1</a>
</p>
</div>
<div id="outline-container-org8807988" class="outline-3">
<h3 id="org8807988">adventure announced</h3>
<div class="outline-text-3" id="text-org8807988">
<p>
Recently, I have been working on a project called <a href="https://github.com/hesterjeng/longleaf">longleaf</a> for algorithmic trading of US stocks with OCaml.  The project has reached a point where it may be interesting to others, so I thought I would share it here and write a simple README, although there could be a lot more documentation.  I would be curious to hear if anyone has any ideas for this!  If you try to use it or have any feedback or questions, feel free to leave a post here, make a github issue, or make a github discussion. 
</p>

<p>
In a nutshell, the idea is that strategies are functors that are instantiated with a "backend" for backtesting, live, or paper trading.  That way, whether you are testing your strategy or running it live, it is exactly the same strategy other than how the execution of orders is handled.  In order to use it, you will need to set up some accounts and there are likely bugs.  Of course, if you use this program with real money and something bad happens, it is entirely your responsibility!
</p>

<p>
<a href="https://github.com/hesterjeng/longleaf">github</a>
</p>
</div>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="3">Neocaml - a TreeSitter-powered Emacs package for OCaml programming</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/neocaml-a-treesitter-powered-emacs-package-for-ocaml-programming/16268/1">https://discuss.ocaml.org/t/neocaml-a-treesitter-powered-emacs-package-for-ocaml-programming/16268/1</a>
</p>
</div>
<div id="outline-container-orgbbe9727" class="outline-3">
<h3 id="orgbbe9727">Bozhidar Batsov announced</h3>
<div class="outline-text-3" id="text-orgbbe9727">
<p>
In a different topics I wrote about about my recent work on neocaml, and I thought it might be a good idea to post something separately as well. Check out the project's GitHub <a href="https://github.com/bbatsov/neocaml">repo</a> and the short <a href="https://batsov.com/articles/2025/03/14/neocaml-a-new-emacs-package-for-ocaml-programming/">blog post</a>.
</p>

<p>
Contributions and feedback are most welcome, and I hope <code>neocaml</code> will be useful to some of you either a tool or as a source of inspiration.
</p>
</div>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="4">Senior Software Engineer at Bloomberg. New York</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/senior-software-engineer-at-bloomberg-new-york/16271/1">https://discuss.ocaml.org/t/senior-software-engineer-at-bloomberg-new-york/16271/1</a>
</p>
</div>
<div id="outline-container-org4b847b7" class="outline-3">
<h3 id="org4b847b7">Maxim Grankin announced</h3>
<div class="outline-text-3" id="text-org4b847b7">
<p>
Hi everyone! 👋
</p>

<p>
Bloomberg is looking for a full-time Senior Software Engineer in New York:
</p>

<ul class="org-ul">
<li>Gain experience applying functional programming to real production financial systems</li>
<li>Use OCaml to develop a robust template system to assist users in creating a wide range of financial instruments across various asset classes</li>
<li>Help shape the strategy for growth of OCaml at Bloomberg by contributing to the various OCaml infrastructure projects across the company</li>
<li>Opportunity to learn some of the financial domain that's at the core of the extensive derivative functionality</li>
</ul>

<p>
Please see more details and/or apply at <a href="https://bloomberg.avature.net/careers/JobDetail?jobId=10730&amp;qtvc=272d0d0846f74b19dc66d7fdc29cec05a0ad67e646ae6c1e1cb94f5ae1c9c4c2#">(Senior Software Engineer - Functional Programming)</a>.
</p>

<p>
Feel free to reach out to me directly by email (mgrankin@bloomberg.net) if you have any questions. Thank you!
</p>
</div>
</div>
</div>
<div id="outline-container-5" class="outline-2">
<h2 id="5">Upcoming Cmdliner 2.0 changes that need your attention</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/upcoming-cmdliner-2-0-changes-that-need-your-attention/16211/2">https://discuss.ocaml.org/t/upcoming-cmdliner-2-0-changes-that-need-your-attention/16211/2</a>
</p>
</div>
<div id="outline-container-org94c06fe" class="outline-3">
<h3 id="org94c06fe">Continuing this thread, Daniel Bünzli announced</h3>
<div class="outline-text-3" id="text-org94c06fe">
<p>
Other <a href="https://github.com/dbuenzli/cmdliner/issues/206">changes</a> you may want to pay attention to is that cmdliner 2.0 will: 
</p>

<ol class="org-ol">
<li>Remove deprecated identifiers.</li>
<li>Make the <a href="https://erratique.ch/software/cmdliner/doc/Cmdliner/Arg/index.html#type-conv"><code>Arg.conv</code></a> type abstract[^1].</li>
</ol>

<p>
If you happen to be walking around your <code>cmdliner</code> usage or making a new cli these days, pay particular attention to 2. as the concrete type has been deprecated since 2017 but sadly it was never possible to make it a visible deprecation (OCaml compiler help us! :man_bowing:). 
</p>

<p>
Note that both 1. and 2. can be resolved now by using cmdliner.1.3.0, there are a few <a href="https://github.com/dbuenzli/cmdliner/issues/206">instructions here</a>. It's no guaranteed, but if you are on <code>opam</code> I may have filed an issue in your issue tracker :waving_hand:.
</p>

<p>
P.S. I think there's not a single occurence where I did not eventually regret making a public type concrete.
</p>

<p>
[^1]:  So that completion behaviours can be defined at that level; aswell as the documentation metavariable which you could specify with <code>Arg.conv</code> constructors for ages but would simply be dropped to return the concrete pair.
</p>
</div>
</div>
</div>
<div id="outline-container-6" class="outline-2">
<h2 id="6">Dune dev meeting</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/26">https://discuss.ocaml.org/t/ann-dune-dev-meeting/14994/26</a>
</p>
</div>
<div id="outline-container-org00d8449" class="outline-3">
<h3 id="org00d8449">Etienne Marais announced</h3>
<div class="outline-text-3" id="text-org00d8449">
<p>
Hi! 
The next Dune Dev Meeting will be on <b>Wednesday, March, 19th at 16:00 CET</b>. This is going to be a one-hour-long meeting.
</p>

<p>
Whether you are a maintainer, a regular contributor, a new joiner or just curious, you are welcome to join: these discussions are opened! The goal of these meetings is to provide a place to discuss the ongoing work together and synchronize with the Dune developers :+1: 
</p>

<p>
The agenda is available on the <a href="https://github.com/ocaml/dune/wiki/dev-meeting-2025-03-19">meeting dedicated page</a>. Feel free to add more items in it.
</p>

<ul class="org-ul">
<li>Meeting link: <a href="https://us06web.zoom.us/j/85096877776?pwd=cWNhU1dHQ1ZNSjZuOUZCQ0h2by9Udz09">zoom</a></li>
<li>Calendar event: <a href="https://calendar.google.com/calendar/u/0/embed?src=c_5cd698df6784e385b1cdcdc1dbca18c061faa96959a04781566d304dc9ec7319@group.calendar.google.com">google calendar</a></li>
<li>Wiki with information and previous notes: <a href="https://github.com/ocaml/dune/wiki">dune wiki on GitHub</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-7" class="outline-2">
<h2 id="7">New release of Monolith (20250314)</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-new-release-of-monolith-20250314/16303/1">https://discuss.ocaml.org/t/ann-new-release-of-monolith-20250314/16303/1</a>
</p>
</div>
<div id="outline-container-orgf3bde68" class="outline-3">
<h3 id="orgf3bde68">François Pottier announced</h3>
<div class="outline-text-3" id="text-orgf3bde68">
<p>
I am pleased to announce a new "Pi Day" release of Monolith.
</p>

<p>
Monolith is an OCaml library that helps perform black-box testing of OCaml libraries, either via purely random testing, or via grey-box fuzzing.
</p>

<p>
This new release adds new command-line options to the executable program that Monolith produces by default. Furthermore, it extends Monolith's API with a new function, <code>run</code>, so the user can invoke Monolith's engine as part of their own application, without letting Monolith parse the command line. These improvements make it easier to use a Monolith-based test as part of a continuous integration (CI) system. Thanks to Gabriel Scherer for suggesting these improvements.
</p>

<pre class="example" id="org80f1205">
opam update
opam install monolith.20250314
</pre>

<p>
Happy testing!
</p>
</div>
</div>
</div>
<div id="outline-container-8" class="outline-2">
<h2 id="8">dream_middleware_ext v0.1.0</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dream-middleware-ext-v0-1-0/16306/1">https://discuss.ocaml.org/t/ann-dream-middleware-ext-v0-1-0/16306/1</a>
</p>
</div>
<div id="outline-container-orgd43f287" class="outline-3">
<h3 id="orgd43f287">Geoffrey Borough announced</h3>
<div class="outline-text-3" id="text-orgd43f287">
<p>
A collection of middleware utilities for Dream framework, Initial release v0.1.0
</p>

<p>
Currently supporting the following functionalities:
</p>

<p>
CORS: Cross-Origin Resource Sharing
</p>

<p>
Delay: simulates delayed request
</p>

<p>
Rate Limiter: supports Fixed Window and Token Bucket algorithms
</p>

<p>
Traffic Filter: supports IP, header and cookie based traffic filters
</p>

<ul class="org-ul">
<li>Project page: <a href="https://github.com/axons-talent/dream_middleware_ext">https://github.com/axons-talent/dream_middleware_ext</a></li>
<li>Documentation: <a href="https://axons-talent.github.io/dream_middleware_ext/dream_middleware_ext">https://axons-talent.github.io/dream_middleware_ext/dream_middleware_ext</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-9" class="outline-2">
<h2 id="9">Learn Programming with OCaml (new book)</h2>
<div class="outline-text-2" id="text-9">
<p>
Archive: <a href="https://discuss.ocaml.org/t/learn-programming-with-ocaml-new-book/16111/13">https://discuss.ocaml.org/t/learn-programming-with-ocaml-new-book/16111/13</a>
</p>
</div>
<div id="outline-container-org67ba7c0" class="outline-3">
<h3 id="org67ba7c0">Continuing this thread, Jean Christophe Filliatre announced</h3>
<div class="outline-text-3" id="text-org67ba7c0">
<p>
<a href="https://usr.lmf.cnrs.fr/lpo/lpo.epub">A preliminary EPUB version of the book</a> is now available. Feedback is most welcome (preferably by <a href="https://github.com/backtracking/learn-programming-with-ocaml/issues">submitting an issue here</a>).
</p>

<p>
Big thanks to @Chet_Murthy who spent weeks working this out from our LaTeX sources.
</p>
</div>
</div>
</div>
<div id="outline-container-10" class="outline-2">
<h2 id="10">Other OCaml News</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org81080fd" class="outline-3">
<h3 id="org81080fd">From the ocaml.org blog</h3>
<div class="outline-text-3" id="text-org81080fd">
<p>
Here are links from many OCaml blogs aggregated at <a href="https://ocaml.org/blog/">the ocaml.org blog</a>.
</p>

<ul class="org-ul">
<li><a href="https://batsov.com/articles/2025/03/14/ocaml-s-standard-library/">OCaml’s Standard Library (<code>Stdlib</code>)</a></li>
<li><a href="https://batsov.com/articles/2025/03/14/neocaml-a-new-emacs-package-for-ocaml-programming/">neocaml: a new Emacs package for OCaml programming</a></li>
<li><a href="https://tarides.com/blog/2025-03-13-we-re-moving-ocsigen-from-lwt-to-eio">We're Moving Ocsigen from Lwt to Eio!</a></li>
<li><a href="https://signals-threads.simplecast.com/episodes/finding-signal-in-the-noise-with-in-young-cho-qBmfD9v_">Finding Signal in the Noise with In Young Cho</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7e451d8" class="outline-2">
<h2 id="org7e451d8">Old CWN</h2>
<div class="outline-text-2" id="text-org7e451d8">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe to the <a href="https://sympa.inria.fr/sympa/info/caml-list">caml-list</a>.
</p>

<div class="authorname" id="orgecfb0f4">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
